{
  "resourceType": "OperationDefinition",
  "id": "-s-get-patient-procedures",
  "url": "https://careplan.devtest.systematic-ehealth.com/fhir/OperationDefinition/-s-get-patient-procedures",
  "name": "get-patient-procedures",
  "title": "Get patient procedures",
  "status": "active",
  "kind": "operation",
  "description": "This operation returns an overview of patient procedures within a time period and filtered by either EpisodeOfCare or Condition code(s). On success, the returned Bundle contains a Parameters structure detailing the count of measurements received and expected. This is done per ServiceRequest with status active for those that are related to EpisodeOfCare either given as input or pertaining to one of the Condition codes. The measurement regime expressed in ServiceRequest.occurrence[x] is, when possible, resolved to time slot(s) corresponding to datetime/period where an action is supposed to take place, typically performed by the Patient. When the occurrenceTiming variant is used, resolved time slots overlapping with the input time periode are considered. For occurrenceTiming expression which are either adhoc or unresolved, the effective datetime/period of a measurement is considered when checked for overlap with input time period.\r\n## Input\r\nThe operation has three mandatory inputs, a Patient reference, a start date and an end date. Additionally the operation has two optional inputs: a list of reference(s) to EpisodeOfCare and a list of Codings for Condition.\r\n### Patient reference\r\nMandatory reference for the Patient which the procedure overview is computed for.\r\n### Start and end datetimes\r\nStart and end datetime are both mandatory, and together specify the period of interest in the patient procedure overview. As stated above, for resolvable past and future time slots as well as adhoc and unresolved timings there must overlap with this period.\r\n### EpisodeOfCare list\r\nThe EpisodeOfCare list is optional, but either of EpisodeOfCare or Condition codes must be provided. If EpisodeOfCare are provided, these will be used to further filter which active CarePlan and ServiceRequest are considered for the patient procedure overview.\r\n### Condition Coding list\r\nThe list of Coding for Condition is optional, but either of EpisodeOfCare or Condition codes must be provided. If Condition Coding are provided, the EpisodeOfCare considered are those referring to a Condition matching at least one of the codes in the list. As above, the EpisodeOfCare (one or more) considered further determines which active CarePlan and ServiceRequest are considered.\r\n## Output\r\nFor valid inputs, the server will compute and return a Bundle. The Bundle contains a Parameters resource with resolved measurement regimes and associated counts of measurement submitted and counts expected. Such counts are also included in the Parameters structure when the measurement regime is either adhoc or unresolved. In addition, the Bundle contains CarePlan and ServiceRequest referenced in the Parameters. The Bundle can contain an OperationOutcome describing any encountered warnings.",
  "affectsState": true,
  "code": "get-patient-procedures",
  "system": true,
  "type": false,
  "instance": false,
  "parameter": [ {
    "name": "patient",
    "use": "in",
    "min": 1,
    "max": "1",
    "type": "Reference"
  }, {
    "name": "episodeOfCare",
    "use": "in",
    "min": 0,
    "max": "*",
    "type": "Reference"
  }, {
    "name": "conditionCodings",
    "use": "in",
    "min": 0,
    "max": "*",
    "type": "Coding"
  }, {
    "name": "start",
    "use": "in",
    "min": 1,
    "max": "1",
    "type": "dateTime"
  }, {
    "name": "end",
    "use": "in",
    "min": 1,
    "max": "1",
    "type": "dateTime"
  }, {
    "name": "return",
    "use": "out",
    "min": 0,
    "max": "1",
    "type": "Bundle"
  } ]
}